cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

tap 'homebrew/bundle'
tap 'homebrew/core'

tap 'neovim/neovim'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
# brew 'git'
brew 'tree'
brew 'wget'

brew 'tmux'
brew 'neovim/neovim/neovim'

brew 'exercism'

# Development
brew 'erlang'
brew 'elixir'
brew 'node'
brew 'python3'
brew 'leiningen'
# brew 'clojure'
brew 'go'
brew 'clisp'

# Mac App Store command line interface
brew 'mas'

# Apps
cask 'firefox'
cask 'google-chrome'
# cask 'sequel-pro'
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
