tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "neovim/neovim"

cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'curl'
brew 'thefuck'
brew 'fzy'
brew 'git'
brew 'gpg'
brew 'mas'
brew 'tree'
brew 'svn'
brew 'wget'

# Editor
brew 'neovim'

# Development
brew 'act'
brew 'asdf'
brew 'node'
brew 'yarn'

# Apps
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'postgres-unofficial'
cask 'slack'

# Fonts
# cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
